espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/**
 * SPDX-FileCopyrightText: 2021-2022 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** INTERRUPT_CORE0_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_MAC_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x0)
/** INTERRUPT_CORE0_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_MAC_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_MAC_INTR_MAP_M  (INTERRUPT_CORE0_MAC_INTR_MAP_V << INTERRUPT_CORE0_MAC_INTR_MAP_S)
#define INTERRUPT_CORE0_MAC_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_MAC_INTR_MAP_S  0

/** INTERRUPT_CORE0_MAC_NMI_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_MAC_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x4)
/** INTERRUPT_CORE0_MAC_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_MAC_NMI_MAP    0x0000001FU
#define INTERRUPT_CORE0_MAC_NMI_MAP_M  (INTERRUPT_CORE0_MAC_NMI_MAP_V << INTERRUPT_CORE0_MAC_NMI_MAP_S)
#define INTERRUPT_CORE0_MAC_NMI_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_MAC_NMI_MAP_S  0

/** INTERRUPT_CORE0_PWR_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_PWR_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x8)
/** INTERRUPT_CORE0_PWR_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_PWR_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_PWR_INTR_MAP_M  (INTERRUPT_CORE0_PWR_INTR_MAP_V << INTERRUPT_CORE0_PWR_INTR_MAP_S)
#define INTERRUPT_CORE0_PWR_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_PWR_INTR_MAP_S  0

/** INTERRUPT_CORE0_BB_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BB_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc)
/** INTERRUPT_CORE0_BB_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BB_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_BB_INT_MAP_M  (INTERRUPT_CORE0_BB_INT_MAP_V << INTERRUPT_CORE0_BB_INT_MAP_S)
#define INTERRUPT_CORE0_BB_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BB_INT_MAP_S  0

/** INTERRUPT_CORE0_BT_MAC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x10)
/** INTERRUPT_CORE0_BT_MAC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BT_MAC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_M  (INTERRUPT_CORE0_BT_MAC_INT_MAP_V << INTERRUPT_CORE0_BT_MAC_INT_MAP_S)
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BT_MAC_INT_MAP_S  0

/** INTERRUPT_CORE0_BT_BB_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BT_BB_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x14)
/** INTERRUPT_CORE0_BT_BB_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BT_BB_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_BT_BB_INT_MAP_M  (INTERRUPT_CORE0_BT_BB_INT_MAP_V << INTERRUPT_CORE0_BT_BB_INT_MAP_S)
#define INTERRUPT_CORE0_BT_BB_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BT_BB_INT_MAP_S  0

/** INTERRUPT_CORE0_BT_BB_NMI_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x18)
/** INTERRUPT_CORE0_BT_BB_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BT_BB_NMI_MAP    0x0000001FU
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_M  (INTERRUPT_CORE0_BT_BB_NMI_MAP_V << INTERRUPT_CORE0_BT_BB_NMI_MAP_S)
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BT_BB_NMI_MAP_S  0

/** INTERRUPT_CORE0_RWBT_IRQ_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_REG (DR_REG_INTERRUPT_BASE + 0x1c)
/** INTERRUPT_CORE0_RWBT_IRQ_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RWBT_IRQ_MAP    0x0000001FU
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_M  (INTERRUPT_CORE0_RWBT_IRQ_MAP_V << INTERRUPT_CORE0_RWBT_IRQ_MAP_S)
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RWBT_IRQ_MAP_S  0

/** INTERRUPT_CORE0_RWBLE_IRQ_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RWBLE_IRQ_MAP_REG (DR_REG_INTERRUPT_BASE + 0x20)
/** INTERRUPT_CORE0_RWBLE_IRQ_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RWBLE_IRQ_MAP    0x0000001FU
#define INTERRUPT_CORE0_RWBLE_IRQ_MAP_M  (INTERRUPT_CORE0_RWBLE_IRQ_MAP_V << INTERRUPT_CORE0_RWBLE_IRQ_MAP_S)
#define INTERRUPT_CORE0_RWBLE_IRQ_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RWBLE_IRQ_MAP_S  0

/** INTERRUPT_CORE0_RWBT_NMI_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RWBT_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x24)
/** INTERRUPT_CORE0_RWBT_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RWBT_NMI_MAP    0x0000001FU
#define INTERRUPT_CORE0_RWBT_NMI_MAP_M  (INTERRUPT_CORE0_RWBT_NMI_MAP_V << INTERRUPT_CORE0_RWBT_NMI_MAP_S)
#define INTERRUPT_CORE0_RWBT_NMI_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RWBT_NMI_MAP_S  0

/** INTERRUPT_CORE0_RWBLE_NMI_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RWBLE_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x28)
/** INTERRUPT_CORE0_RWBLE_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RWBLE_NMI_MAP    0x0000001FU
#define INTERRUPT_CORE0_RWBLE_NMI_MAP_M  (INTERRUPT_CORE0_RWBLE_NMI_MAP_V << INTERRUPT_CORE0_RWBLE_NMI_MAP_S)
#define INTERRUPT_CORE0_RWBLE_NMI_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RWBLE_NMI_MAP_S  0

/** INTERRUPT_CORE0_I2C_MST_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_I2C_MST_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x2c)
/** INTERRUPT_CORE0_I2C_MST_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_I2C_MST_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_I2C_MST_INT_MAP_M  (INTERRUPT_CORE0_I2C_MST_INT_MAP_V << INTERRUPT_CORE0_I2C_MST_INT_MAP_S)
#define INTERRUPT_CORE0_I2C_MST_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_I2C_MST_INT_MAP_S  0

/** INTERRUPT_CORE0_SLC0_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SLC0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x30)
/** INTERRUPT_CORE0_SLC0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SLC0_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_SLC0_INTR_MAP_M  (INTERRUPT_CORE0_SLC0_INTR_MAP_V << INTERRUPT_CORE0_SLC0_INTR_MAP_S)
#define INTERRUPT_CORE0_SLC0_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SLC0_INTR_MAP_S  0

/** INTERRUPT_CORE0_SLC1_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SLC1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x34)
/** INTERRUPT_CORE0_SLC1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SLC1_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_SLC1_INTR_MAP_M  (INTERRUPT_CORE0_SLC1_INTR_MAP_V << INTERRUPT_CORE0_SLC1_INTR_MAP_S)
#define INTERRUPT_CORE0_SLC1_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SLC1_INTR_MAP_S  0

/** INTERRUPT_CORE0_APB_CTRL_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_APB_CTRL_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x38)
/** INTERRUPT_CORE0_APB_CTRL_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_APB_CTRL_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_APB_CTRL_INTR_MAP_M  (INTERRUPT_CORE0_APB_CTRL_INTR_MAP_V << INTERRUPT_CORE0_APB_CTRL_INTR_MAP_S)
#define INTERRUPT_CORE0_APB_CTRL_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_APB_CTRL_INTR_MAP_S  0

/** INTERRUPT_CORE0_UHCI0_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x3c)
/** INTERRUPT_CORE0_UHCI0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_UHCI0_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_M  (INTERRUPT_CORE0_UHCI0_INTR_MAP_V << INTERRUPT_CORE0_UHCI0_INTR_MAP_S)
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_UHCI0_INTR_MAP_S  0

/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_REG (DR_REG_INTERRUPT_BASE + 0x40)
/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP    0x0000001FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_MAP_S  0

/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_REG (DR_REG_INTERRUPT_BASE + 0x44)
/** INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP    0x0000001FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_M  (INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_V << INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_S)
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

/** INTERRUPT_CORE0_SPI_INTR_1_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_REG (DR_REG_INTERRUPT_BASE + 0x48)
/** INTERRUPT_CORE0_SPI_INTR_1_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SPI_INTR_1_MAP    0x0000001FU
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_M  (INTERRUPT_CORE0_SPI_INTR_1_MAP_V << INTERRUPT_CORE0_SPI_INTR_1_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SPI_INTR_1_MAP_S  0

/** INTERRUPT_CORE0_SPI_INTR_2_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_REG (DR_REG_INTERRUPT_BASE + 0x4c)
/** INTERRUPT_CORE0_SPI_INTR_2_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SPI_INTR_2_MAP    0x0000001FU
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_M  (INTERRUPT_CORE0_SPI_INTR_2_MAP_V << INTERRUPT_CORE0_SPI_INTR_2_MAP_S)
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SPI_INTR_2_MAP_S  0

/** INTERRUPT_CORE0_I2S1_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_I2S1_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x50)
/** INTERRUPT_CORE0_I2S1_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_I2S1_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_I2S1_INT_MAP_M  (INTERRUPT_CORE0_I2S1_INT_MAP_V << INTERRUPT_CORE0_I2S1_INT_MAP_S)
#define INTERRUPT_CORE0_I2S1_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_I2S1_INT_MAP_S  0

/** INTERRUPT_CORE0_UART_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_UART_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x54)
/** INTERRUPT_CORE0_UART_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_UART_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_UART_INTR_MAP_M  (INTERRUPT_CORE0_UART_INTR_MAP_V << INTERRUPT_CORE0_UART_INTR_MAP_S)
#define INTERRUPT_CORE0_UART_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_UART_INTR_MAP_S  0

/** INTERRUPT_CORE0_UART1_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x58)
/** INTERRUPT_CORE0_UART1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_UART1_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_M  (INTERRUPT_CORE0_UART1_INTR_MAP_V << INTERRUPT_CORE0_UART1_INTR_MAP_S)
#define INTERRUPT_CORE0_UART1_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_UART1_INTR_MAP_S  0

/** INTERRUPT_CORE0_LEDC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_LEDC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x5c)
/** INTERRUPT_CORE0_LEDC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_LEDC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_LEDC_INT_MAP_M  (INTERRUPT_CORE0_LEDC_INT_MAP_V << INTERRUPT_CORE0_LEDC_INT_MAP_S)
#define INTERRUPT_CORE0_LEDC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_LEDC_INT_MAP_S  0

/** INTERRUPT_CORE0_EFUSE_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_EFUSE_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x60)
/** INTERRUPT_CORE0_EFUSE_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_EFUSE_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_EFUSE_INT_MAP_M  (INTERRUPT_CORE0_EFUSE_INT_MAP_V << INTERRUPT_CORE0_EFUSE_INT_MAP_S)
#define INTERRUPT_CORE0_EFUSE_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_EFUSE_INT_MAP_S  0

/** INTERRUPT_CORE0_TWAI_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TWAI_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x64)
/** INTERRUPT_CORE0_TWAI_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TWAI_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TWAI_INT_MAP_M  (INTERRUPT_CORE0_TWAI_INT_MAP_V << INTERRUPT_CORE0_TWAI_INT_MAP_S)
#define INTERRUPT_CORE0_TWAI_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TWAI_INT_MAP_S  0

/** INTERRUPT_CORE0_USB_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_USB_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x68)
/** INTERRUPT_CORE0_USB_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_USB_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_USB_INTR_MAP_M  (INTERRUPT_CORE0_USB_INTR_MAP_V << INTERRUPT_CORE0_USB_INTR_MAP_S)
#define INTERRUPT_CORE0_USB_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_USB_INTR_MAP_S  0

