espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_RTC_CORE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x6c)
/** INTERRUPT_CORE0_RTC_CORE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_M  (INTERRUPT_CORE0_RTC_CORE_INTR_MAP_V << INTERRUPT_CORE0_RTC_CORE_INTR_MAP_S)
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RTC_CORE_INTR_MAP_S  0

/** INTERRUPT_CORE0_RMT_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RMT_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x70)
/** INTERRUPT_CORE0_RMT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RMT_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_RMT_INTR_MAP_M  (INTERRUPT_CORE0_RMT_INTR_MAP_V << INTERRUPT_CORE0_RMT_INTR_MAP_S)
#define INTERRUPT_CORE0_RMT_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RMT_INTR_MAP_S  0

/** INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0x74)
/** INTERRUPT_CORE0_I2C_EXT0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_M  (INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V << INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S)
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_I2C_EXT0_INTR_MAP_S  0

/** INTERRUPT_CORE0_TIMER_INT1_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TIMER_INT1_MAP_REG (DR_REG_INTERRUPT_BASE + 0x78)
/** INTERRUPT_CORE0_TIMER_INT1_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TIMER_INT1_MAP    0x0000001FU
#define INTERRUPT_CORE0_TIMER_INT1_MAP_M  (INTERRUPT_CORE0_TIMER_INT1_MAP_V << INTERRUPT_CORE0_TIMER_INT1_MAP_S)
#define INTERRUPT_CORE0_TIMER_INT1_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TIMER_INT1_MAP_S  0

/** INTERRUPT_CORE0_TIMER_INT2_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TIMER_INT2_MAP_REG (DR_REG_INTERRUPT_BASE + 0x7c)
/** INTERRUPT_CORE0_TIMER_INT2_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TIMER_INT2_MAP    0x0000001FU
#define INTERRUPT_CORE0_TIMER_INT2_MAP_M  (INTERRUPT_CORE0_TIMER_INT2_MAP_V << INTERRUPT_CORE0_TIMER_INT2_MAP_S)
#define INTERRUPT_CORE0_TIMER_INT2_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TIMER_INT2_MAP_S  0

/** INTERRUPT_CORE0_TG_T0_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG_T0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x80)
/** INTERRUPT_CORE0_TG_T0_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG_T0_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG_T0_INT_MAP_M  (INTERRUPT_CORE0_TG_T0_INT_MAP_V << INTERRUPT_CORE0_TG_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TG_T0_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG_T0_INT_MAP_S  0

/** INTERRUPT_CORE0_TG_WDT_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x84)
/** INTERRUPT_CORE0_TG_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG_WDT_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_M  (INTERRUPT_CORE0_TG_WDT_INT_MAP_V << INTERRUPT_CORE0_TG_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_TG1_T0_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x88)
/** INTERRUPT_CORE0_TG1_T0_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG1_T0_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_M  (INTERRUPT_CORE0_TG1_T0_INT_MAP_V << INTERRUPT_CORE0_TG1_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG1_T0_INT_MAP_S  0

/** INTERRUPT_CORE0_TG1_WDT_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x8c)
/** INTERRUPT_CORE0_TG1_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_M  (INTERRUPT_CORE0_TG1_WDT_INT_MAP_V << INTERRUPT_CORE0_TG1_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG1_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_CACHE_IA_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x90)
/** INTERRUPT_CORE0_CACHE_IA_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_M  (INTERRUPT_CORE0_CACHE_IA_INT_MAP_V << INTERRUPT_CORE0_CACHE_IA_INT_MAP_S)
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CACHE_IA_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x94)
/** INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET0_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x98)
/** INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET1_INT_MAP_S  0

/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x9c)
/** INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_M  (INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_V << INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_S)
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SYSTIMER_TARGET2_INT_MAP_S  0

/** INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa0)
/** INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_M  (INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_V << INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_S)
#define INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SPI_MEM_REJECT_INTR_MAP_S  0

