espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa4)
/** INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_M  (INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_V << INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_S)
#define INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_ICACHE_PRELOAD_INT_MAP_S  0

/** INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xa8)
/** INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_M  (INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_V << INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_S)
#define INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_ICACHE_SYNC_INT_MAP_S  0

/** INTERRUPT_CORE0_APB_ADC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_APB_ADC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xac)
/** INTERRUPT_CORE0_APB_ADC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_APB_ADC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_APB_ADC_INT_MAP_M  (INTERRUPT_CORE0_APB_ADC_INT_MAP_V << INTERRUPT_CORE0_APB_ADC_INT_MAP_S)
#define INTERRUPT_CORE0_APB_ADC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_APB_ADC_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA_CH0_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_DMA_CH0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb0)
/** INTERRUPT_CORE0_DMA_CH0_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_DMA_CH0_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_DMA_CH0_INT_MAP_M  (INTERRUPT_CORE0_DMA_CH0_INT_MAP_V << INTERRUPT_CORE0_DMA_CH0_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_CH0_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_DMA_CH0_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA_CH1_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_DMA_CH1_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb4)
/** INTERRUPT_CORE0_DMA_CH1_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_DMA_CH1_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_DMA_CH1_INT_MAP_M  (INTERRUPT_CORE0_DMA_CH1_INT_MAP_V << INTERRUPT_CORE0_DMA_CH1_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_CH1_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_DMA_CH1_INT_MAP_S  0

/** INTERRUPT_CORE0_DMA_CH2_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_DMA_CH2_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xb8)
/** INTERRUPT_CORE0_DMA_CH2_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_DMA_CH2_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_DMA_CH2_INT_MAP_M  (INTERRUPT_CORE0_DMA_CH2_INT_MAP_V << INTERRUPT_CORE0_DMA_CH2_INT_MAP_S)
#define INTERRUPT_CORE0_DMA_CH2_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_DMA_CH2_INT_MAP_S  0

/** INTERRUPT_CORE0_RSA_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RSA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xbc)
/** INTERRUPT_CORE0_RSA_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RSA_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_RSA_INT_MAP_M  (INTERRUPT_CORE0_RSA_INT_MAP_V << INTERRUPT_CORE0_RSA_INT_MAP_S)
#define INTERRUPT_CORE0_RSA_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RSA_INT_MAP_S  0

/** INTERRUPT_CORE0_AES_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_AES_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc0)
/** INTERRUPT_CORE0_AES_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_AES_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_AES_INT_MAP_M  (INTERRUPT_CORE0_AES_INT_MAP_V << INTERRUPT_CORE0_AES_INT_MAP_S)
#define INTERRUPT_CORE0_AES_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_AES_INT_MAP_S  0

/** INTERRUPT_CORE0_SHA_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_SHA_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc4)
/** INTERRUPT_CORE0_SHA_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_SHA_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_SHA_INT_MAP_M  (INTERRUPT_CORE0_SHA_INT_MAP_V << INTERRUPT_CORE0_SHA_INT_MAP_S)
#define INTERRUPT_CORE0_SHA_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_SHA_INT_MAP_S  0

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG (DR_REG_INTERRUPT_BASE + 0xc8)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP    0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_0_MAP_S  0

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG (DR_REG_INTERRUPT_BASE + 0xcc)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP    0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_1_MAP_S  0

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd0)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP    0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_2_MAP_S  0

/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd4)
/** INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP    0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_M  (INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_V << INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CPU_INTR_FROM_CPU_3_MAP_S  0

/** INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xd8)
/** INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_M  (INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_V << INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_S)
#define INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_ASSIST_DEBUG_INTR_MAP_S  0

/** INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xdc)
/** INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos: [4:0];
 *  default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_DMA_APBPERI_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/** INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe0)
/** INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos: [4:0];
 *  default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CORE_0_IRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/** INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe4)
/** INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos: [4:0];
 *  default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CORE_0_DRAM0_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

/** INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xe8)
/** INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP : R/W; bitpos: [4:0];
 *  default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V << INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_INTR_MAP_S  0

