espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xec)
/** INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP : R/W; bitpos: [4:0];
 *  default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_M  (INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V << INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S)
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CORE_0_PIF_PMS_MONITOR_VIOLATE_SIZE_INTR_MAP_S  0

/** INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf0)
/** INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP    0x0000001FU
#define INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_M  (INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_V << INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_S)
#define INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BACKUP_PMS_VIOLATE_INTR_MAP_S  0

/** INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf4)
/** INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_M  (INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_V << INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_S)
#define INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_CACHE_CORE0_ACS_INT_MAP_S  0

/** INTERRUPT_CORE0_TG3_T0_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG3_T0_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xf8)
/** INTERRUPT_CORE0_TG3_T0_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG3_T0_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG3_T0_INT_MAP_M  (INTERRUPT_CORE0_TG3_T0_INT_MAP_V << INTERRUPT_CORE0_TG3_T0_INT_MAP_S)
#define INTERRUPT_CORE0_TG3_T0_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG3_T0_INT_MAP_S  0

/** INTERRUPT_CORE0_TG3_WDT_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_TG3_WDT_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0xfc)
/** INTERRUPT_CORE0_TG3_WDT_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_TG3_WDT_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_TG3_WDT_INT_MAP_M  (INTERRUPT_CORE0_TG3_WDT_INT_MAP_V << INTERRUPT_CORE0_TG3_WDT_INT_MAP_S)
#define INTERRUPT_CORE0_TG3_WDT_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_TG3_WDT_INT_MAP_S  0

/** INTERRUPT_CORE0_BLE_SEC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_BLE_SEC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x100)
/** INTERRUPT_CORE0_BLE_SEC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_BLE_SEC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_BLE_SEC_INT_MAP_M  (INTERRUPT_CORE0_BLE_SEC_INT_MAP_V << INTERRUPT_CORE0_BLE_SEC_INT_MAP_S)
#define INTERRUPT_CORE0_BLE_SEC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_BLE_SEC_INT_MAP_S  0

/** INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x104)
/** INTERRUPT_CORE0_IEEE802154MAC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_IEEE802154MAC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_M  (INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_V << INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_S)
#define INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_IEEE802154MAC_INT_MAP_S  0

/** INTERRUPT_CORE0_IEEE802154BB_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_IEEE802154BB_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x108)
/** INTERRUPT_CORE0_IEEE802154BB_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_IEEE802154BB_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_IEEE802154BB_INT_MAP_M  (INTERRUPT_CORE0_IEEE802154BB_INT_MAP_V << INTERRUPT_CORE0_IEEE802154BB_INT_MAP_S)
#define INTERRUPT_CORE0_IEEE802154BB_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_IEEE802154BB_INT_MAP_S  0

/** INTERRUPT_CORE0_COEX_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_COEX_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x10c)
/** INTERRUPT_CORE0_COEX_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_COEX_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_COEX_INT_MAP_M  (INTERRUPT_CORE0_COEX_INT_MAP_V << INTERRUPT_CORE0_COEX_INT_MAP_S)
#define INTERRUPT_CORE0_COEX_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_COEX_INT_MAP_S  0

/** INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x110)
/** INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_M  (INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_V << INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_S)
#define INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_RTC_BLE_TMR_INT_MAP_S  0

/** INTERRUPT_CORE0_ECC_INT_MAP_REG register
 *  register description
 */
#define INTERRUPT_CORE0_ECC_INT_MAP_REG (DR_REG_INTERRUPT_BASE + 0x114)
/** INTERRUPT_CORE0_ECC_INT_MAP : R/W; bitpos: [4:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_ECC_INT_MAP    0x0000001FU
#define INTERRUPT_CORE0_ECC_INT_MAP_M  (INTERRUPT_CORE0_ECC_INT_MAP_V << INTERRUPT_CORE0_ECC_INT_MAP_S)
#define INTERRUPT_CORE0_ECC_INT_MAP_V  0x0000001FU
#define INTERRUPT_CORE0_ECC_INT_MAP_S  0

