espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_INTR_STATUS_REG_0_REG register
 *  register description
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_0_REG (DR_REG_INTERRUPT_BASE + 0x118)
/** INTERRUPT_CORE0_INTR_STATUS_0 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_INTR_STATUS_0    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_0_M  (INTERRUPT_CORE0_INTR_STATUS_0_V << INTERRUPT_CORE0_INTR_STATUS_0_S)
#define INTERRUPT_CORE0_INTR_STATUS_0_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_0_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_1_REG register
 *  register description
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_1_REG (DR_REG_INTERRUPT_BASE + 0x11c)
/** INTERRUPT_CORE0_INTR_STATUS_1 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_INTR_STATUS_1    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_1_M  (INTERRUPT_CORE0_INTR_STATUS_1_V << INTERRUPT_CORE0_INTR_STATUS_1_S)
#define INTERRUPT_CORE0_INTR_STATUS_1_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_1_S  0

/** INTERRUPT_CORE0_INTR_STATUS_REG_2_REG register
 *  register description
 */
#define INTERRUPT_CORE0_INTR_STATUS_REG_2_REG (DR_REG_INTERRUPT_BASE + 0x120)
/** INTERRUPT_CORE0_INTR_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_INTR_STATUS_2    0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_2_M  (INTERRUPT_CORE0_INTR_STATUS_2_V << INTERRUPT_CORE0_INTR_STATUS_2_S)
#define INTERRUPT_CORE0_INTR_STATUS_2_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_INTR_STATUS_2_S  0

/** INTERRUPT_CORE0_CLOCK_GATE_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CLOCK_GATE_REG (DR_REG_INTERRUPT_BASE + 0x124)
/** INTERRUPT_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Need add description
 */
#define INTERRUPT_CORE0_REG_CLK_EN    (BIT(0))
#define INTERRUPT_CORE0_REG_CLK_EN_M  (INTERRUPT_CORE0_REG_CLK_EN_V << INTERRUPT_CORE0_REG_CLK_EN_S)
#define INTERRUPT_CORE0_REG_CLK_EN_V  0x00000001U
#define INTERRUPT_CORE0_REG_CLK_EN_S  0

/** INTERRUPT_CORE0_CPU_INT_ENABLE_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_ENABLE_REG (DR_REG_INTERRUPT_BASE + 0x128)
/** INTERRUPT_CORE0_CPU_INT_ENABLE : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INT_ENABLE    0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_ENABLE_M  (INTERRUPT_CORE0_CPU_INT_ENABLE_V << INTERRUPT_CORE0_CPU_INT_ENABLE_S)
#define INTERRUPT_CORE0_CPU_INT_ENABLE_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_ENABLE_S  0

/** INTERRUPT_CORE0_CPU_INT_TYPE_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_TYPE_REG (DR_REG_INTERRUPT_BASE + 0x12c)
/** INTERRUPT_CORE0_CPU_INT_TYPE : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INT_TYPE    0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_TYPE_M  (INTERRUPT_CORE0_CPU_INT_TYPE_V << INTERRUPT_CORE0_CPU_INT_TYPE_S)
#define INTERRUPT_CORE0_CPU_INT_TYPE_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_TYPE_S  0

/** INTERRUPT_CORE0_CPU_INT_CLEAR_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_CLEAR_REG (DR_REG_INTERRUPT_BASE + 0x130)
/** INTERRUPT_CORE0_CPU_INT_CLEAR : R/W; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INT_CLEAR    0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_CLEAR_M  (INTERRUPT_CORE0_CPU_INT_CLEAR_V << INTERRUPT_CORE0_CPU_INT_CLEAR_S)
#define INTERRUPT_CORE0_CPU_INT_CLEAR_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_CLEAR_S  0

/** INTERRUPT_CORE0_CPU_INT_EIP_STATUS_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_EIP_STATUS_REG (DR_REG_INTERRUPT_BASE + 0x134)
/** INTERRUPT_CORE0_CPU_INT_EIP_STATUS : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INT_EIP_STATUS    0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_EIP_STATUS_M  (INTERRUPT_CORE0_CPU_INT_EIP_STATUS_V << INTERRUPT_CORE0_CPU_INT_EIP_STATUS_S)
#define INTERRUPT_CORE0_CPU_INT_EIP_STATUS_V  0xFFFFFFFFU
#define INTERRUPT_CORE0_CPU_INT_EIP_STATUS_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_0_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_0_REG (DR_REG_INTERRUPT_BASE + 0x138)

#define INTC_INT_PRIO_REG(n)                        (INTERRUPT_CORE0_CPU_INT_PRI_0_REG + (n)*4)
/** INTERRUPT_CORE0_CPU_PRI_0_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_0_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_0_MAP_M  (INTERRUPT_CORE0_CPU_PRI_0_MAP_V << INTERRUPT_CORE0_CPU_PRI_0_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_0_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_0_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_1_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_1_REG (DR_REG_INTERRUPT_BASE + 0x13c)
/** INTERRUPT_CORE0_CPU_PRI_1_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_1_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_1_MAP_M  (INTERRUPT_CORE0_CPU_PRI_1_MAP_V << INTERRUPT_CORE0_CPU_PRI_1_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_1_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_1_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_2_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_2_REG (DR_REG_INTERRUPT_BASE + 0x140)
/** INTERRUPT_CORE0_CPU_PRI_2_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_2_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_M  (INTERRUPT_CORE0_CPU_PRI_2_MAP_V << INTERRUPT_CORE0_CPU_PRI_2_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_2_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_3_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_3_REG (DR_REG_INTERRUPT_BASE + 0x144)
/** INTERRUPT_CORE0_CPU_PRI_3_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_3_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_M  (INTERRUPT_CORE0_CPU_PRI_3_MAP_V << INTERRUPT_CORE0_CPU_PRI_3_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_3_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_4_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_4_REG (DR_REG_INTERRUPT_BASE + 0x148)
/** INTERRUPT_CORE0_CPU_PRI_4_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_4_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_M  (INTERRUPT_CORE0_CPU_PRI_4_MAP_V << INTERRUPT_CORE0_CPU_PRI_4_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_4_MAP_S  0

