espressif/esp-idf/components/soc/esp32h4/include/rev2/soc/interrupt_core0_reg.h
/** INTERRUPT_CORE0_CPU_INT_PRI_18_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_18_REG (DR_REG_INTERRUPT_BASE + 0x180)
/** INTERRUPT_CORE0_CPU_PRI_18_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_18_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_18_MAP_M  (INTERRUPT_CORE0_CPU_PRI_18_MAP_V << INTERRUPT_CORE0_CPU_PRI_18_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_18_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_18_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_19_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_19_REG (DR_REG_INTERRUPT_BASE + 0x184)
/** INTERRUPT_CORE0_CPU_PRI_19_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_19_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_19_MAP_M  (INTERRUPT_CORE0_CPU_PRI_19_MAP_V << INTERRUPT_CORE0_CPU_PRI_19_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_19_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_19_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_20_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_20_REG (DR_REG_INTERRUPT_BASE + 0x188)
/** INTERRUPT_CORE0_CPU_PRI_20_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_20_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_20_MAP_M  (INTERRUPT_CORE0_CPU_PRI_20_MAP_V << INTERRUPT_CORE0_CPU_PRI_20_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_20_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_20_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_21_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_21_REG (DR_REG_INTERRUPT_BASE + 0x18c)
/** INTERRUPT_CORE0_CPU_PRI_21_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_21_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_21_MAP_M  (INTERRUPT_CORE0_CPU_PRI_21_MAP_V << INTERRUPT_CORE0_CPU_PRI_21_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_21_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_21_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_22_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_22_REG (DR_REG_INTERRUPT_BASE + 0x190)
/** INTERRUPT_CORE0_CPU_PRI_22_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_22_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_22_MAP_M  (INTERRUPT_CORE0_CPU_PRI_22_MAP_V << INTERRUPT_CORE0_CPU_PRI_22_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_22_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_22_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_23_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_23_REG (DR_REG_INTERRUPT_BASE + 0x194)
/** INTERRUPT_CORE0_CPU_PRI_23_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_23_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_23_MAP_M  (INTERRUPT_CORE0_CPU_PRI_23_MAP_V << INTERRUPT_CORE0_CPU_PRI_23_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_23_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_23_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_24_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_24_REG (DR_REG_INTERRUPT_BASE + 0x198)
/** INTERRUPT_CORE0_CPU_PRI_24_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_24_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_24_MAP_M  (INTERRUPT_CORE0_CPU_PRI_24_MAP_V << INTERRUPT_CORE0_CPU_PRI_24_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_24_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_24_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_25_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_25_REG (DR_REG_INTERRUPT_BASE + 0x19c)
/** INTERRUPT_CORE0_CPU_PRI_25_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_25_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_25_MAP_M  (INTERRUPT_CORE0_CPU_PRI_25_MAP_V << INTERRUPT_CORE0_CPU_PRI_25_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_25_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_25_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_26_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_26_REG (DR_REG_INTERRUPT_BASE + 0x1a0)
/** INTERRUPT_CORE0_CPU_PRI_26_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_26_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_26_MAP_M  (INTERRUPT_CORE0_CPU_PRI_26_MAP_V << INTERRUPT_CORE0_CPU_PRI_26_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_26_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_26_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_27_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_27_REG (DR_REG_INTERRUPT_BASE + 0x1a4)
/** INTERRUPT_CORE0_CPU_PRI_27_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_27_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_27_MAP_M  (INTERRUPT_CORE0_CPU_PRI_27_MAP_V << INTERRUPT_CORE0_CPU_PRI_27_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_27_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_27_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_28_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_28_REG (DR_REG_INTERRUPT_BASE + 0x1a8)
/** INTERRUPT_CORE0_CPU_PRI_28_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_28_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_28_MAP_M  (INTERRUPT_CORE0_CPU_PRI_28_MAP_V << INTERRUPT_CORE0_CPU_PRI_28_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_28_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_28_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_29_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_29_REG (DR_REG_INTERRUPT_BASE + 0x1ac)
/** INTERRUPT_CORE0_CPU_PRI_29_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_29_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_29_MAP_M  (INTERRUPT_CORE0_CPU_PRI_29_MAP_V << INTERRUPT_CORE0_CPU_PRI_29_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_29_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_29_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_30_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_30_REG (DR_REG_INTERRUPT_BASE + 0x1b0)
/** INTERRUPT_CORE0_CPU_PRI_30_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_30_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_30_MAP_M  (INTERRUPT_CORE0_CPU_PRI_30_MAP_V << INTERRUPT_CORE0_CPU_PRI_30_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_30_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_30_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_PRI_31_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_PRI_31_REG (DR_REG_INTERRUPT_BASE + 0x1b4)
/** INTERRUPT_CORE0_CPU_PRI_31_MAP : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_PRI_31_MAP    0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_31_MAP_M  (INTERRUPT_CORE0_CPU_PRI_31_MAP_V << INTERRUPT_CORE0_CPU_PRI_31_MAP_S)
#define INTERRUPT_CORE0_CPU_PRI_31_MAP_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_PRI_31_MAP_S  0

/** INTERRUPT_CORE0_CPU_INT_THRESH_REG register
 *  register description
 */
#define INTERRUPT_CORE0_CPU_INT_THRESH_REG (DR_REG_INTERRUPT_BASE + 0x1b8)
/** INTERRUPT_CORE0_CPU_INT_THRESH : R/W; bitpos: [3:0]; default: 0;
 *  Need add description
 */
#define INTERRUPT_CORE0_CPU_INT_THRESH    0x0000000FU
#define INTERRUPT_CORE0_CPU_INT_THRESH_M  (INTERRUPT_CORE0_CPU_INT_THRESH_V << INTERRUPT_CORE0_CPU_INT_THRESH_S)
#define INTERRUPT_CORE0_CPU_INT_THRESH_V  0x0000000FU
#define INTERRUPT_CORE0_CPU_INT_THRESH_S  0

/** INTERRUPT_CORE0_INTERRUPT_REG_DATE_REG register
 *  register description
 */
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_REG (DR_REG_INTERRUPT_BASE + 0x7fc)
/** INTERRUPT_CORE0_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 33624208;
 *  Need add description
 */
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_M  (INTERRUPT_CORE0_INTERRUPT_REG_DATE_V << INTERRUPT_CORE0_INTERRUPT_REG_DATE_S)
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define INTERRUPT_CORE0_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
